# BIDDING ON BATTERS
## Finding the Strike Rate of batsman
To get aggressive batsman for the team, 10 players with high Strike Rate has to be selected,out of which, 2-3 players with good Strike Rate can be chosen for the team.

In [6]:
%%sql
SELECT batsman,(SUM(batsman_runs)/COUNT(balls)) * 100 AS strike_rate FROM trial_ball WHERE extras_type <> 'wides' 
GROUP BY batsman HAVING COUNT(balls) > 500 
ORDER BY strike_rate DESC limit 10;

 * postgresql://postgres:***@localhost/IPL_DB
10 rows affected.

[('AD Russell', 182.33173076923077),
 ('SP Narine', 164.27255985267035),
 ('HH Pandya', 159.2680047225502),
 ('V Sehwag', 155.44159544159544),
 ('GJ Maxwell', 154.67625899280574),
 ('RR Pant', 151.9736842105263),
 ('AB de Villiers', 151.9110275689223),
 ('CH Gayle', 150.1100975149418),
 ('KA Pollard', 149.87605354486863),
 ('JC Buttler', 149.56369982547992)]

## Finding Average of players
To get good anchor batsman for the team, 10 players who have played for more than 2 IPL seasons with good average has to be selected, out of which, 2-3 players with good average can be chosen for the team.

In [7]:
%%sql
SELECT
  batsman,
  seasons_played,
  total_runs,
  dismissal_count,
  total_runs / dismissal_count AS average
  FROM (
  SELECT
    batsman,
    SUM(batsman_runs) AS total_runs,
    COUNT(CASE WHEN is_wicket = 1 THEN 1 END) AS dismissal_count,
    COUNT(DISTINCT EXTRACT(YEAR FROM match_date)) AS seasons_played
  FROM trial_ball
  INNER JOIN trial_matches ON trial_ball.player_id = trial_matches.player_id
  GROUP BY batsman
  HAVING COUNT(DISTINCT EXTRACT(YEAR FROM match_date))> 2 AND COUNT(CASE WHEN is_wicket = 1 THEN 1 END) > 1
) AS averages
ORDER BY average DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/IPL_DB
10 rows affected.

[('KL Rahul', 7, 2647.0, 62, 42.693548387096776),
 ('AB de Villiers', 13, 4849.0, 114, 42.53508771929825),
 ('DA Warner', 11, 5254.0, 126, 41.698412698412696),
 ('JP Duminy', 8, 2029.0, 49, 41.40816326530612),
 ('CH Gayle', 12, 4772.0, 116, 41.13793103448276),
 ('ML Hayden', 3, 1107.0, 27, 41.0),
 ('LMP Simmons', 4, 1079.0, 27, 39.96296296296296),
 ('KS Williamson', 6, 1619.0, 41, 39.48780487804878),
 ('OA Shah', 4, 506.0, 13, 38.92307692307692),
 ('SE Marsh', 9, 2477.0, 64, 38.703125)]

## Finding Boundary Percentage
Hard-hitting players, who have scored most runs in boundary(4 and 6) and have played for more than 2 IPL seasons has to be selected, out of which, 2-3 players with good boundary percentage can be chosen for the team.

In [8]:
%%sql
SELECT
  trial_ball.batsman,
  COUNT(CASE WHEN trial_ball.batsman_runs = 4 OR trial_ball.batsman_runs = 6 THEN 1 END) AS boundary_count,
  SUM(CASE WHEN trial_ball.batsman_runs = 4 OR trial_ball.batsman_runs = 6 THEN trial_ball.batsman_runs ELSE 0 END) AS boundary_runs,
  SUM(trial_ball.total_runs) AS total_runs,
  (SUM(CASE WHEN trial_ball.batsman_runs = 4 OR trial_ball.batsman_runs = 6 THEN trial_ball.batsman_runs ELSE 0 END) / SUM(trial_ball.total_runs)) * 100 AS boundary_percentage
FROM trial_ball
JOIN trial_matches ON trial_ball.player_id = trial_matches.player_id
GROUP BY trial_ball.batsman
HAVING COUNT(DISTINCT EXTRACT(YEAR FROM trial_matches.match_date)) > 2
ORDER BY boundary_percentage DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/IPL_DB
10 rows affected.

[('SP Narine', 155, 724.0, 959.0, 75.49530761209593),
 ('AD Russell', 234, 1194.0, 1604.0, 74.43890274314214),
 ('CH Gayle', 733, 3630.0, 5103.0, 71.13462669018224),
 ('BCJ Cutting', 34, 174.0, 251.0, 69.32270916334662),
 ('KK Cooper', 17, 84.0, 122.0, 68.85245901639344),
 ('CR Brathwaite', 26, 136.0, 198.0, 68.68686868686868),
 ('MM Ali', 44, 222.0, 324.0, 68.51851851851852),
 ('AC Gilchrist', 331, 1508.0, 2215.0, 68.08126410835214),
 ('MS Gony', 14, 72.0, 106.0, 67.9245283018868),
 ('V Sehwag', 440, 1972.0, 2915.0, 67.6500857632933)]

# BIDDING ON BOWLERS
## Finding Economy of Bowlers
Economy of a bowler can be calculated by dividing total runs conceded by total overs bowled. 10 players who have bowled atleast 500 balls has to be selected, out of which, 2-3 players with lowest economy can be chosen for the team.

In [9]:
%%sql
SELECT
  trial_ball.bowler,
  SUM(trial_ball.total_runs) AS total_runs_conceded,
  COUNT(trial_ball.balls) / 6 AS total_overs_bowled,
  SUM(trial_ball.total_runs) / (COUNT(trial_ball.balls) / 6) AS economy
FROM trial_ball
GROUP BY trial_ball.bowler
HAVING COUNT(balls) >= 500
ORDER BY economy asc
LIMIT 10;

 * postgresql://postgres:***@localhost/IPL_DB
10 rows affected.

[('Rashid Khan', 1573.0, 248, 6.342741935483871),
 ('A Kumble', 1089.0, 163, 6.680981595092025),
 ('M Muralitharan', 1755.0, 262, 6.698473282442748),
 ('DW Steyn', 2568.0, 379, 6.775725593667546),
 ('R Ashwin', 3756.0, 554, 6.7797833935018055),
 ('SP Narine', 3208.0, 470, 6.825531914893617),
 ('DL Vettori', 894.0, 130, 6.876923076923077),
 ('Washington Sundar', 758.0, 110, 6.890909090909091),
 ('J Botha', 818.0, 118, 6.932203389830509),
 ('Harbhajan Singh', 4038.0, 575, 7.022608695652174)]

## Finding Strike Rate of Bowlers
10 bowlers who have bowled atleast 500 balls with good strike rate has to be selected, out of which, 2-3 players with good strike rate can be chosen for the team.

In [10]:
%%sql
SELECT
  tb.bowler,
  SUM(CASE WHEN tb.is_wicket = 1 THEN 1 ELSE 0 END) AS total_wickets,
  subquery.total_balls AS total_balls_bowled,
  subquery.total_balls / SUM(CASE WHEN tb.is_wicket = 1 THEN 1 ELSE 0 END) AS strike_rate
FROM trial_ball AS tb
JOIN (
  SELECT tb2.bowler, COUNT(tb2.balls) AS total_balls
  FROM trial_ball AS tb2
  GROUP BY tb2.bowler
  HAVING COUNT(tb2.balls) >= 500
) AS subquery ON tb.bowler = subquery.bowler
WHERE tb.dismissal_kind NOT IN ('runout', 'NA', 'obstructing the field', 'retired hurt', 'run out')
GROUP BY tb.bowler, subquery.total_balls
ORDER BY strike_rate ASC
LIMIT 10;

 * postgresql://postgres:***@localhost/IPL_DB
10 rows affected.

[('K Rabada', 61, 840, 13),
 ('AJ Tye', 40, 645, 16),
 ('DE Bollinger', 37, 600, 16),
 ('Imran Tahir', 80, 1314, 16),
 ('S Aravind', 45, 788, 17),
 ('SL Malinga', 170, 2974, 17),
 ('A Nehra', 106, 1974, 18),
 ('MA Starc', 34, 612, 18),
 ('DJ Bravo', 153, 2846, 18),
 ('JC Archer', 46, 858, 18)]

# BIDDING ON ALL-ROUNDERS
## Finding batting and bowling Strike Rate
To get all-rounders for the team, 10 players who have faced atleast 500 balls during batting and have bowled over 300 balls during bowling with good batting and bowling Strike Rate has to be selected,out of which, 2-3 players can be chosen for the team.

In [11]:
%%sql
SELECT batsman_stats.batsman, batsman_stats.batsman_strike_rate, bowler_stats.bowler, bowler_stats.bowler_strike_rate
FROM
(
  SELECT batsman, (SUM(batsman_runs) / COUNT(balls)) * 100 AS batsman_strike_rate
  FROM trial_ball
  WHERE extras_type <> 'wides'
  GROUP BY batsman
  HAVING COUNT(balls) > 500
) AS batsman_stats
INNER JOIN
(
  SELECT bowler, COUNT(balls) / SUM(CASE WHEN is_wicket = 1 THEN 1 END) AS bowler_strike_rate
  FROM trial_ball 
  GROUP BY bowler
  HAVING COUNT(balls) > 300
) AS bowler_stats ON batsman_stats.batsman = bowler_stats.bowler order by batsman_strike_rate desc, bowler_strike_rate desc
limit 10;

 * postgresql://postgres:***@localhost/IPL_DB
10 rows affected.

[('AD Russell', 182.33173076923077, 'AD Russell', 17),
 ('SP Narine', 164.27255985267035, 'SP Narine', 19),
 ('HH Pandya', 159.2680047225502, 'HH Pandya', 20),
 ('GJ Maxwell', 154.67625899280574, 'GJ Maxwell', 27),
 ('CH Gayle', 150.1100975149418, 'CH Gayle', 30),
 ('KA Pollard', 149.87605354486863, 'KA Pollard', 19),
 ('ST Jayasuriya', 144.36090225563908, 'ST Jayasuriya', 18),
 ('YK Pathan', 142.9718875502008, 'YK Pathan', 25),
 ('KH Pandya', 142.45014245014244, 'KH Pandya', 26),
 ('JA Morkel', 141.98250728862973, 'JA Morkel', 18)]

## CITIES THAT HAVE HOSTED AN IPL MATCH

In [14]:
%%sql
SELECT DISTINCT city FROM trial_matches WHERE city <> 'NA';

 * postgresql://postgres:***@localhost/IPL_DB
32 rows affected.

[('Jaipur',),
 ('Abu Dhabi',),
 ('Visakhapatnam',),
 ('Kochi',),
 ('Dharamsala',),
 ('Port Elizabeth',),
 ('Hyderabad',),
 ('Indore',),
 ('Bangalore',),
 ('Mumbai',),
 ('Delhi',),
 ('Pune',),
 ('East London',),
 ('Durban',),
 ('Sharjah',),
 ('Cape Town',),
 ('Bengaluru',),
 ('Raipur',),
 ('Nagpur',),
 ('Kimberley',),
 ('Centurion',),
 ('Kolkata',),
 ('Ahmedabad',),
 ('Chandigarh',),
 ('Johannesburg',),
 ('Bloemfontein',),
 ('Kanpur',),
 ('Cuttack',),
 ('Ranchi',),
 ('Rajkot',),
 ('Chennai',),
 ('Dubai',)]

### BATSMAN WITH HIGHEST RUNS

In [15]:
%%sql
SELECT batsman, sum(batsman_runs) as runs FROM trial_ball GROUP BY batsman ORDER BY runs DESC LIMIT 10;

 * postgresql://postgres:***@localhost/IPL_DB
10 rows affected.

[('V Kohli', 5878.0),
 ('SK Raina', 5368.0),
 ('DA Warner', 5254.0),
 ('RG Sharma', 5230.0),
 ('S Dhawan', 5197.0),
 ('AB de Villiers', 4849.0),
 ('CH Gayle', 4772.0),
 ('MS Dhoni', 4632.0),
 ('RV Uthappa', 4607.0),
 ('G Gambhir', 4217.0)]

In [16]:
pwd

'C:\\Users\\Asus\\Untitled Folder 1'